98euijae/STM32H743_TouchGFX/Core/Src/main.c
    /* Send the command */
    HAL_SDRAM_SendCommand(hsdram, Command, SDRAM_TIMEOUT);
    
    /* Step 6: Set the refresh rate counter */
    /* Set the device refresh rate */
    HAL_SDRAM_ProgramRefreshRate(hsdram, REFRESH_COUNT); 
    
}

static void SD_Initialization()
{
    if(FATFS_LinkDriver(&SD_Driver, SDPath) == 0)
    {
        BSP_SD_Init(0);
        HAL_NVIC_SetPriority(SysTick_IRQn, 0x0E, 0);
        
        if(BSP_SD_IsDetected(0))
        {
            if(f_mount(&SDFatFs, (TCHAR const*)SDPath, 0) == FR_OK)
            {
                
            }
        }
    }
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
* @brief  Function implementing the defaultTask thread.
* @param  argument: Not used
* @retval None
*/
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
    /* USER CODE BEGIN 5 */
    /* Infinite loop */
    for(;;)
    {
        osDelay(1);
    }
    /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_TouchGFX_Task */
/**
* @brief Function implementing the GUI_Task thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_TouchGFX_Task */
__weak void TouchGFX_Task(void *argument)
{
    /* USER CODE BEGIN TouchGFX_Task */
    /* Infinite loop */
    for(;;)
    {
        osDelay(1);
    }
    /* USER CODE END TouchGFX_Task */
}

/* USER CODE BEGIN Header_ReadSDDataTask */
/**
* @brief Function implementing the ReadSDData thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_ReadSDDataTask */
void ReadSDDataTask(void *argument)
{
    /* USER CODE BEGIN ReadSDDataTask */
    int fileOpenedFlag = 0;
    uint8_t readData;
    int dataCnt = 0;
    int dataFlag = 0;
    int minusFlag = 0;
    uint32_t eventFlags;
    SDData_t data;
    
    data.readSuccess = 0;
    /* Infinite loop */
    for(;;)
    {
        for(int i = 0; i < DATA_SIZE; i++)
        {
            data.dataX[i] = 0;
            data.dataY[i] = 0;
        }
        data.readSize = 0;
        //        eventFlags = osEventFlagsWait(SDEventHandle, 1, osFlagsWaitAny, osWaitForever);
        if(fileOpenedFlag == 0)
        {
            __disable_irq();
            if(f_open(&MyFile, "sim_data_conv.txt", FA_READ) == FR_OK)
            {
                fileOpenedFlag = 1;
            }
            __enable_irq();
        }
        if(fileOpenedFlag == 1)
        {
            while(dataCnt != DATA_SIZE)
            {
                __disable_irq();
                if(f_read(&MyFile, &readData, sizeof(readData), NULL) == FR_OK)
                {
                    __enable_irq();
                    if(readData >= 0x30 && readData <= 0x39)
                    {
                        if(dataFlag == 0)
                            data.dataX[dataCnt] = (data.dataX[dataCnt] * 10) + (int)(readData - 0x30);
                        else
                            data.dataY[dataCnt] = (data.dataY[dataCnt] * 10) + (int)(readData - 0x30);                                             
                    }
                    else if(readData == 0x09 || readData == 0x0A)
                    {
                        if(dataFlag == 0)
                        {
                            if(minusFlag == 1)
                                data.dataX[dataCnt] = -data.dataX[dataCnt];
                            dataFlag = 1;
                        }
                        else
                        {
                            if(minusFlag == 1)
                                data.dataY[dataCnt] = -data.dataY[dataCnt];
                            dataFlag = 0;
                            dataCnt++;
                            data.readSize++;
                        }
                        minusFlag = 0;
                    }
                    else if(readData == 0x2D)
                    {
                        minusFlag = 1;
                    }
                }
                else
                {
                    __enable_irq();
                }
                __disable_irq();
                if(f_eof(&MyFile))
                {
                    f_close(&MyFile);
                    __enable_irq();
                    fileOpenedFlag = 0;
                    break;
                }
                __enable_irq();
            }
            data.readSuccess = 1;
            dataCnt = 0;
        }
        osMessageQueuePut(SDQueueHandle, &data, 0, 0);
        osDelay(1);
    }
    /* USER CODE END ReadSDDataTask */
}

/* MPU Configuration */

void MPU_Config(void)
{
    MPU_Region_InitTypeDef MPU_InitStruct = {0};
    
    /* Disables the MPU */
    HAL_MPU_Disable();
    
    /** Initializes and configures the Region and the memory to be protected
    */
    MPU_InitStruct.Enable = MPU_REGION_ENABLE;
    MPU_InitStruct.Number = MPU_REGION_NUMBER0;
    MPU_InitStruct.BaseAddress = 0xD0000000;
    MPU_InitStruct.Size = MPU_REGION_SIZE_64MB;
    MPU_InitStruct.SubRegionDisable = 0x0;
    MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
    MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
    MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
    MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;
    
    HAL_MPU_ConfigRegion(&MPU_InitStruct);
    /* Enables the MPU */
    HAL_MPU_Enable(MPU_HFNMI_PRIVDEF);
    
}

/**
* @brief  Period elapsed callback in non blocking mode
* @note   This function is called  when TIM7 interrupt took place, inside
* HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
* a global variable "uwTick" used as application time base.
* @param  htim : TIM handle
* @retval None
*/
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    /* USER CODE BEGIN Callback 0 */
    
    /* USER CODE END Callback 0 */
    if (htim->Instance == TIM7) {
        HAL_IncTick();
    }
    /* USER CODE BEGIN Callback 1 */
    
    /* USER CODE END Callback 1 */
}

/**
* @brief  This function is executed in case of error occurrence.
* @retval None
*/
void Error_Handler(void)
{
    /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */
    __disable_irq();
    while (1)
    {
    }
    /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
* @brief  Reports the name of the source file and the source line number
*         where the assert_param error has occurred.
* @param  file: pointer to the source file name
* @param  line: assert_param error line source number
* @retval None
*/
void assert_failed(uint8_t *file, uint32_t line)
{
    /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
    /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
